Config/Catalogs/СпособыОтраженияЗарплатыВБухУчете.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СпособыОтраженияЗарплатыВБухУчете</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
	</Catalog>
</MetaDataObject>

Config/InformationRegisters/НастройкаСпособовОтраженияЗарплатыВБухУчете.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкаСпособовОтраженияЗарплатыВБухУчете</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СчетДт</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Субконто1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Субконто2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Субконто3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетНУ</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СубконтоНУ1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СубконтоНУ2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СубконтоНУ3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтражениеВУСН</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОтражениеВУСН</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеИспользоватьВходящиеДанныеЗГУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодЦели</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦелевыхСредств</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодМероприятия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопКлассификация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительнаяБюджетнаяКлассификация</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СпособОтраженияЗарплатыВБухУчете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВБухУчете</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПоЗарплате</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодНалоговогоОргана</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Catalogs/СпособыОтраженияЗарплатыВБухУчете/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗагрузитьЭлементы(ЭлементыКЗагрузке = Неопределено) Экспорт
	
	ТекстМакета = ПолучитьМакет("НастройкиПредопределенныхСпособовОтражения").ПолучитьТекст(); 
	НастройкиСпособов = ОбщегоНазначения.ЗначениеИзСтрокиXML(ТекстМакета);

	Настройка = Новый Структура;
	Настройка.Вставить("СпособОтраженияЗарплатыВБухУчете");
	Настройка.Вставить("ВидОперации");
	Настройка.Вставить("СчетДт");
	Настройка.Вставить("Субконто1");
	Настройка.Вставить("Субконто2");
	Настройка.Вставить("Субконто3");
	Настройка.Вставить("СчетНУ");
	Настройка.Вставить("СубконтоНУ1");
	Настройка.Вставить("СубконтоНУ2");
	Настройка.Вставить("СубконтоНУ3");
	Настройка.Вставить("ОтражениеВУСН");
	Настройка.Вставить("НеИспользоватьВходящиеДанныеЗГУ");
	
	ВыборкаОрганизаций = Справочники.Организации.Выбрать();
	
	Пока ВыборкаОрганизаций.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.НастройкаСпособовОтраженияЗарплатыВБухУчете.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Организация.Установить(ВыборкаОрганизаций.Ссылка);
		НаборЗаписей.Прочитать();
		
		ТаблицаНастроек = НаборЗаписей.Выгрузить();
		
		Для Каждого Стр Из НастройкиСпособов Цикл
			СпособОтраженияЗарплатыВБухУчете = Справочники.СпособыОтраженияЗарплатыВБухУчете[Стр.СпособОтраженияЗарплатыВБухУчете];
			ВидОперации = Перечисления.ВидыОперацийПоЗарплате[Стр.ВидОперации];
			
			Строки = ТаблицаНастроек.НайтиСтроки(Новый Структура("СпособОтраженияЗарплатыВБухУчете, ВидОперации",
																	СпособОтраженияЗарплатыВБухУчете, ВидОперации));
			
			Если Строки.Количество() = 0 Тогда
				Настройка.СпособОтраженияЗарплатыВБухУчете = СпособОтраженияЗарплатыВБухУчете;
				Настройка.ВидОперации = ВидОперации;
				Настройка.СчетДт = БухгалтерскийУчет.СчетПоКоду(Стр.СчетДт, ТекущаяДатаСеанса());
				Настройка.СчетНУ = БухгалтерскийУчет.СчетПоКоду(Стр.СчетНУ, ТекущаяДатаСеанса());
				Настройка.ОтражениеВУСН = Стр.ОтражениеВУСН;
		
				ЗначенияСубконто(Стр, Настройка, "ВидСубконто");
				ЗначенияСубконто(Стр, Настройка, "ВидСубконтоНУ");
				
				Стр = НаборЗаписей.Добавить();
			
				ЗаполнитьЗначенияСвойств(Стр, Настройка);
			
				Стр.Организация = ВыборкаОрганизаций.Ссылка;
				Стр.Период = НачалоМесяца(ТекущаяДатаСеанса());
			КонецЕсли;													
		КонецЦикла;
		
		Если НаборЗаписей.Модифицированность() Тогда
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей, Истина, Истина);
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗначенияСубконто(Стр, Настройка, ТекстВидСубконто)
	Для К = 1 По 3 Цикл
		Если Не ЗначениеЗаполнено(Стр[ТекстВидСубконто+К]) Тогда
			Продолжить;
		КонецЕсли;
		
		Субконто = Неопределено;
		
		ВидСубконто = ПланыВидовХарактеристик.ВидыСубконто[Стр[ТекстВидСубконто+К]];
		СоставнойТип = (ВидСубконто.ТипЗначения.Типы().Количество() > 1);
		
		Если СоставнойТип Тогда
			Для Каждого Тип Из ВидСубконто.ТипЗначения.Типы() Цикл
				Массив = Новый Массив;
				Массив.Добавить(Тип);
				Описание = Новый ОписаниеТипов(Массив);
				
				ВидОМ = ОбщегоНазначения.ВидОбъектаПоТипу(Тип);
				ИмяОМ = Описание.ПривестиЗначение().Метаданные().Имя;
				
				МенеджерОМ = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ВидОМ+"."+ИмяОМ);
				
				Попытка
					Субконто = МенеджерОМ[Стр["Субконто"+К]];
				Исключение
				КонецПопытки;
				
				Если Субконто <> Неопределено Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
		Иначе
			ВидОМ = ОбщегоНазначения.ВидОбъектаПоТипу(ВидСубконто.ТипЗначения.Типы()[0]);
			ИмяОМ = ВидСубконто.ТипЗначения.ПривестиЗначение().Метаданные().Имя;
			
			МенеджерОМ = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ВидОМ+"."+ИмяОМ);
			Субконто = МенеджерОМ[Стр["Субконто"+К]];
		КонецЕсли;
		
		Настройка["Субконто"+К] = Субконто;
	КонецЦикла;
КонецПроцедуры
	
#КонецОбласти

#КонецЕсли
